build/docs/runtime/utils/factories/property-class-factory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Property Class Factory</title>
<!-- 2017-04-27 Thu 09:31 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Property Class Factory</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Usage</a></li>
<li><a href="#sec-3">3. Implementation</a></li>
<li><a href="#sec-4">4. Note</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This factory produces property classes.
</p>

<p>
Property classes are classes with property fields and a
standard interface for getting and setting them, and a
subset of property fields used for determining equality.
</p>

<p>
The specification to produce a class includes the class's
name, its keys (the set of fields used to identify two
instances of the class), and its attributes and their types.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Usage</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
Email = PropertyClassFactory.mk_class("Email", ['val'], val=is_email_str)

Name = PropertyClassFactory.mk_class("Name", ['val'], val=is_alphabetic_str)

Role = PropertyClassFactory.mk_class("Role", ['val'], val=is_role_str)

User = PropertyClassFactory.mk_class("User", ['email'], 
                                      email=Email.is_inst, 
                                      name=Name.is_inst,
                                      roles=list_of(Role.is_inst))

Session = PropertyClassFactory.mk_class("Session", ['key'], 
                                 user=User.is_inst, role=Role.is_inst, 
                                 key=is_str)
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">from</span>  runtime.utils.class_templates.class_templates <span style="font-weight: bold;">import</span> ClassTemplate
<span style="font-weight: bold;">from</span>  runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> is_inst
<span style="font-weight: bold;">from</span>  runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> check_pred
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">PropertyClassFactory</span>():

<span style="font-weight: bold; font-style: italic;">#    </span><span style="font-weight: bold; font-style: italic;">User = mk_class("User", ['email'], email=Email.is_inst, name=Name.is_inst)</span>
    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mk_class</span>(_name, _unique_keys, **args):
        <span style="font-weight: bold; font-style: italic;">cls</span> = ClassTemplate.mk_class(_name)
        <span style="font-weight: bold; font-style: italic;">cls.is_inst</span> = <span style="font-weight: bold;">staticmethod</span>(is_inst(cls))
        <span style="font-weight: bold; font-style: italic;">cls.check_inst</span> = <span style="font-weight: bold;">staticmethod</span>(check_pred(cls.is_inst))
        cls.add_attributes(**args)
        <span style="font-weight: bold; font-style: italic;">cls.__eq__</span> = <span style="font-weight: bold;">lambda</span> <span style="font-weight: bold;">self</span>, other: \
                         <span style="font-weight: bold;">self</span>.is_inst(other) <span style="font-weight: bold;">and</span> \
                         <span style="font-weight: bold;">all</span>(<span style="font-weight: bold;">map</span>(<span style="font-weight: bold;">lambda</span> key: <span style="font-weight: bold;">self</span>.get(key) == other.get(key),
                                 _unique_keys))
        <span style="font-weight: bold;">return</span> cls
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Note</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>PropertyClassFactory</code> and <code>ClassTemplate</code> should be folded
into one class.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-04-27 Thu 09:31</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
